; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=42, remove_proportion=0.2, bases=8, instance_id=25, output=./training, seed=66

(define (problem warehouse-25)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 - box
        base1 base2 base3 base4 base5 base6 base7 base8 - base
    )
    (:init
        (to-remove box5)
        (to-remove box7)
        (to-remove box16)
        (to-remove box17)
        (to-remove box19)
        (to-remove box20)
        (to-remove box28)
        (to-remove box29)
        (clear box10)
        (on box10 box16)
        (on box16 box15)
        (on box15 box35)
        (on box35 box40)
        (on-base box40 base1)
        (clear box30)
        (on box30 box32)
        (on box32 box5)
        (on box5 box11)
        (on box11 box36)
        (on box36 box25)
        (on box25 box42)
        (on-base box42 base2)
        (clear box13)
        (on box13 box2)
        (on box2 box4)
        (on box4 box7)
        (on-base box7 base3)
        (clear box17)
        (on box17 box26)
        (on box26 box19)
        (on box19 box23)
        (on-base box23 base4)
        (clear box31)
        (on box31 box22)
        (on box22 box24)
        (on box24 box34)
        (on-base box34 base5)
        (clear box6)
        (on box6 box27)
        (on box27 box20)
        (on box20 box14)
        (on box14 box37)
        (on box37 box28)
        (on-base box28 base6)
        (clear box33)
        (on box33 box12)
        (on box12 box39)
        (on box39 box41)
        (on box41 box8)
        (on box8 box29)
        (on-base box29 base7)
        (clear box3)
        (on box3 box9)
        (on box9 box21)
        (on box21 box18)
        (on box18 box38)
        (on box38 box1)
        (on-base box1 base8)
    )
    (:goal (and 
        (removed box5)
        (removed box7)
        (removed box16)
        (removed box17)
        (removed box19)
        (removed box20)
        (removed box28)
        (removed box29)
    ))
)

; plan
1. (move box10 box16 box3)
   deleted: (clear box3) (on box10 box16)
   added: (on box10 box3) (clear box16)
   goals met: 0 of 8
2. (move box13 box2 box10)
   deleted: (clear box10) (on box13 box2)
   added: (on box13 box10) (clear box2)
   goals met: 0 of 8
3. (move box2 box4 box13)
   deleted: (clear box13) (on box2 box4)
   added: (on box2 box13) (clear box4)
   goals met: 0 of 8
4. (remove box16 box15)
   deleted: (on box16 box15) (clear box16)
   added: (removed box16) (clear box15)
   goals met: 1 of 8
5. (move box30 box32 box15)
   deleted: (clear box15) (on box30 box32)
   added: (on box30 box15) (clear box32)
   goals met: 1 of 8
6. (remove box17 box26)
   deleted: (on box17 box26) (clear box17)
   added: (removed box17) (clear box26)
   goals met: 2 of 8
7. (move box26 box19 box2)
   deleted: (clear box2) (on box26 box19)
   added: (on box26 box2) (clear box19)
   goals met: 2 of 8
8. (remove box19 box23)
   deleted: (on box19 box23) (clear box19)
   added: (removed box19) (clear box23)
   goals met: 3 of 8
9. (move box32 box5 box23)
   deleted: (clear box23) (on box32 box5)
   added: (on box32 box23) (clear box5)
   goals met: 3 of 8
10. (move box33 box12 box26)
   deleted: (clear box26) (on box33 box12)
   added: (on box33 box26) (clear box12)
   goals met: 3 of 8
11. (move box12 box39 box30)
   deleted: (clear box30) (on box12 box39)
   added: (on box12 box30) (clear box39)
   goals met: 3 of 8
12. (move box39 box41 box12)
   deleted: (clear box12) (on box39 box41)
   added: (on box39 box12) (clear box41)
   goals met: 3 of 8
13. (move box4 box7 box31)
   deleted: (clear box31) (on box4 box7)
   added: (on box4 box31) (clear box7)
   goals met: 3 of 8
14. (move box41 box8 box32)
   deleted: (clear box32) (on box41 box8)
   added: (on box41 box32) (clear box8)
   goals met: 3 of 8
15. (move box6 box27 box33)
   deleted: (clear box33) (on box6 box27)
   added: (on box6 box33) (clear box27)
   goals met: 3 of 8
16. (move box27 box20 box39)
   deleted: (clear box39) (on box27 box20)
   added: (on box27 box39) (clear box20)
   goals met: 3 of 8
17. (remove box20 box14)
   deleted: (on box20 box14) (clear box20)
   added: (removed box20) (clear box14)
   goals met: 4 of 8
18. (move box14 box37 box27)
   deleted: (clear box27) (on box14 box37)
   added: (on box14 box27) (clear box37)
   goals met: 4 of 8
19. (move box37 box28 box14)
   deleted: (clear box14) (on box37 box28)
   added: (on box37 box14) (clear box28)
   goals met: 4 of 8
20. (remove-from-base box28 base6)
   deleted: (on-base box28 base6) (clear box28)
   added: (removed box28) (clear-base base6)
   goals met: 5 of 8
21. (move box8 box29 box37)
   deleted: (clear box37) (on box8 box29)
   added: (on box8 box37) (clear box29)
   goals met: 5 of 8
22. (remove-from-base box29 base7)
   deleted: (on-base box29 base7) (clear box29)
   added: (removed box29) (clear-base base7)
   goals met: 6 of 8
23. (remove box5 box11)
   deleted: (on box5 box11) (clear box5)
   added: (removed box5) (clear box11)
   goals met: 7 of 8
24. (remove-from-base box7 base3)
   deleted: (on-base box7 base3) (clear box7)
   added: (removed box7) (clear-base base3)
   goals met: 8 of 8
